tmux/base.conf
# [[file:tmux.org::*Set default shell][Set default shell:1]]
set -g default-shell /usr/local/bin/fish
# Set default shell:1 ends here

# [[file:tmux.org::*XTerm Keys][XTerm Keys:1]]
set -g xterm-keys on
# XTerm Keys:1 ends here

# [[file:tmux.org::*Disable Auto-Renaming][Disable Auto-Renaming:1]]
set-option -g allow-rename off
# Disable Auto-Renaming:1 ends here

# [[file:tmux.org::*Mouse and Mouse Wheel Support][Mouse and Mouse Wheel Support:1]]
set -g mouse on
bind-key -T root WheelUpPane if-shell -F -t = "#{alternate_on}" "send-keys -M" "select-pane -t =; copy-mode -e; send-keys -M"
bind-key -T root WheelDownPane if-shell -F -t = "#{alternate_on}" "send-keys -M" "select-pane -t =; send-keys -M"
# Mouse and Mouse Wheel Support:1 ends here

# [[file:tmux.org::*VIM Bindings][VIM Bindings:1]]
setw -g mode-keys vi
bind h select-pane -L
bind j select-pane -D
bind k select-pane -U
bind l select-pane -R
# VIM Bindings:1 ends here

# [[file:tmux.org::*VIM Bindings][VIM Bindings:2]]
bind-key -r C-h select-window -t :-
bind-key -r C-l select-window -t :+
# VIM Bindings:2 ends here

# [[file:tmux.org::*VIM Bindings][VIM Bindings:3]]
bind-key -T copy-mode-vi v send-keys -X begin-selection
bind-key -T copy-mode-vi V send-keys -X select-line
bind-key -T copy-mode-vi C-V send-keys -X rectangle-toggle
# VIM Bindings:3 ends here

# [[file:tmux.org::*Resizing Key Bindings][Resizing Key Bindings:1]]
bind-key -r Down resize-pane -D 5
bind-key -r Up resize-pane -U 5
bind-key -r Left resize-pane -L 20
bind-key -r Right resize-pane -R 20
# Resizing Key Bindings:1 ends here

# [[file:tmux.org::*Splitting][Splitting:1]]
bind-key K split-window
bind-key J split-window
bind-key H split-window -h
bind-key L split-window -h
bind-key | split-window -h
bind-key - split-window -v
# Splitting:1 ends here

# [[file:tmux.org::*Support Nested Sessions][Support Nested Sessions:1]]
bind-key b send-prefix
# Support Nested Sessions:1 ends here
